MattyMroz/SW/ZADANIA/ZAD3/project1/Core/Inc/stm32l4xx_hal_conf.h
#ifndefSTM32L4xx_HAL_CONF_H#defineSTM32L4xx_HAL_CONF_H#ifdef__cplusplusextern"C"{#endif#defineHAL_MODULE_ENABLED#defineHAL_GPIO_MODULE_ENABLED#defineHAL_EXTI_MODULE_ENABLED#defineHAL_DMA_MODULE_ENABLED#defineHAL_RCC_MODULE_ENABLED#defineHAL_FLASH_MODULE_ENABLED#defineHAL_PWR_MODULE_ENABLED#defineHAL_CORTEX_MODULE_ENABLED#if!defined(HSE_VALUE)#defineHSE_VALUE((uint32_t)8000000U)#endif#if!defined(HSE_STARTUP_TIMEOUT)#defineHSE_STARTUP_TIMEOUT((uint32_t)100U)#endif#if!defined(MSI_VALUE)#defineMSI_VALUE((uint32_t)4000000U)#endif#if!defined(HSI_VALUE)#defineHSI_VALUE((uint32_t)16000000U)#endif#if!defined(HSI48_VALUE)#defineHSI48_VALUE((uint32_t)48000000U)#endif#if!defined(LSI_VALUE)#defineLSI_VALUE32000U#endif#if!defined(LSE_VALUE)#defineLSE_VALUE32768U#endif#if!defined(LSE_STARTUP_TIMEOUT)#defineLSE_STARTUP_TIMEOUT5000U#endif#if!defined(EXTERNAL_SAI1_CLOCK_VALUE)#defineEXTERNAL_SAI1_CLOCK_VALUE2097000U#endif#if!defined(EXTERNAL_SAI2_CLOCK_VALUE)#defineEXTERNAL_SAI2_CLOCK_VALUE2097000U#endif#defineVDD_VALUE3300U#defineTICK_INT_PRIORITY15U#defineUSE_RTOS0U#definePREFETCH_ENABLE0U#defineINSTRUCTION_CACHE_ENABLE1U#defineDATA_CACHE_ENABLE1U#defineUSE_HAL_ADC_REGISTER_CALLBACKS0U#defineUSE_HAL_CAN_REGISTER_CALLBACKS0U#defineUSE_HAL_COMP_REGISTER_CALLBACKS0U#defineUSE_HAL_CRYP_REGISTER_CALLBACKS0U#defineUSE_HAL_DAC_REGISTER_CALLBACKS0U#defineUSE_HAL_DCMI_REGISTER_CALLBACKS0U#defineUSE_HAL_DFSDM_REGISTER_CALLBACKS0U#defineUSE_HAL_DMA2D_REGISTER_CALLBACKS0U#defineUSE_HAL_DSI_REGISTER_CALLBACKS0U#defineUSE_HAL_GFXMMU_REGISTER_CALLBACKS0U#defineUSE_HAL_HASH_REGISTER_CALLBACKS0U#defineUSE_HAL_HCD_REGISTER_CALLBACKS0U#defineUSE_HAL_I2C_REGISTER_CALLBACKS0U#defineUSE_HAL_IRDA_REGISTER_CALLBACKS0U#defineUSE_HAL_LPTIM_REGISTER_CALLBACKS0U#defineUSE_HAL_LTDC_REGISTER_CALLBACKS0U#defineUSE_HAL_MMC_REGISTER_CALLBACKS0U#defineUSE_HAL_OPAMP_REGISTER_CALLBACKS0U#defineUSE_HAL_OSPI_REGISTER_CALLBACKS0U#defineUSE_HAL_PCD_REGISTER_CALLBACKS0U#defineUSE_HAL_QSPI_REGISTER_CALLBACKS0U#defineUSE_HAL_RNG_REGISTER_CALLBACKS0U#defineUSE_HAL_RTC_REGISTER_CALLBACKS0U#defineUSE_HAL_SAI_REGISTER_CALLBACKS0U#defineUSE_HAL_SD_REGISTER_CALLBACKS0U#defineUSE_HAL_SMARTCARD_REGISTER_CALLBACKS0U#defineUSE_HAL_SMBUS_REGISTER_CALLBACKS0U#defineUSE_HAL_SPI_REGISTER_CALLBACKS0U#defineUSE_HAL_SWPMI_REGISTER_CALLBACKS0U#defineUSE_HAL_TIM_REGISTER_CALLBACKS0U#defineUSE_HAL_TSC_REGISTER_CALLBACKS0U#defineUSE_HAL_UART_REGISTER_CALLBACKS0U#defineUSE_HAL_USART_REGISTER_CALLBACKS0U#defineUSE_HAL_WWDG_REGISTER_CALLBACKS0U#defineUSE_SPI_CRC0U#ifdefHAL_RCC_MODULE_ENABLED#include"stm32l4xx_hal_rcc.h"#endif#ifdefHAL_GPIO_MODULE_ENABLED#include"stm32l4xx_hal_gpio.h"#endif#ifdefHAL_DMA_MODULE_ENABLED#include"stm32l4xx_hal_dma.h"#endif#ifdefHAL_DFSDM_MODULE_ENABLED#include"stm32l4xx_hal_dfsdm.h"#endif#ifdefHAL_CORTEX_MODULE_ENABLED#include"stm32l4xx_hal_cortex.h"#endif#ifdefHAL_ADC_MODULE_ENABLED#include"stm32l4xx_hal_adc.h"#endif#ifdefHAL_CAN_MODULE_ENABLED#include"stm32l4xx_hal_can.h"#endif#ifdefHAL_CAN_LEGACY_MODULE_ENABLED#include"Legacy/stm32l4xx_hal_can_legacy.h"#endif#ifdefHAL_COMP_MODULE_ENABLED#include"stm32l4xx_hal_comp.h"#endif#ifdefHAL_CRC_MODULE_ENABLED#include"stm32l4xx_hal_crc.h"#endif#ifdefHAL_CRYP_MODULE_ENABLED#include"stm32l4xx_hal_cryp.h"#endif#ifdefHAL_DAC_MODULE_ENABLED#include"stm32l4xx_hal_dac.h"#endif#ifdefHAL_DCMI_MODULE_ENABLED#include"stm32l4xx_hal_dcmi.h"#endif#ifdefHAL_DMA2D_MODULE_ENABLED#include"stm32l4xx_hal_dma2d.h"#endif#ifdefHAL_DSI_MODULE_ENABLED#include"stm32l4xx_hal_dsi.h"#endif#ifdefHAL_EXTI_MODULE_ENABLED#include"stm32l4xx_hal_exti.h"#endif#ifdefHAL_GFXMMU_MODULE_ENABLED#include"stm32l4xx_hal_gfxmmu.h"#endif#ifdefHAL_FIREWALL_MODULE_ENABLED#include"stm32l4xx_hal_firewall.h"#endif#ifdefHAL_FLASH_MODULE_ENABLED#include"stm32l4xx_hal_flash.h"#endif#ifdefHAL_HASH_MODULE_ENABLED#include"stm32l4xx_hal_hash.h"#endif#ifdefHAL_HCD_MODULE_ENABLED#include"stm32l4xx_hal_hcd.h"#endif#ifdefHAL_I2C_MODULE_ENABLED#include"stm32l4xx_hal_i2c.h"#endif#ifdefHAL_IRDA_MODULE_ENABLED#include"stm32l4xx_hal_irda.h"#endif#ifdefHAL_IWDG_MODULE_ENABLED#include"stm32l4xx_hal_iwdg.h"#endif#ifdefHAL_LCD_MODULE_ENABLED#include"stm32l4xx_hal_lcd.h"#endif#ifdefHAL_LPTIM_MODULE_ENABLED#include"stm32l4xx_hal_lptim.h"#endif#ifdefHAL_LTDC_MODULE_ENABLED#include"stm32l4xx_hal_ltdc.h"#endif#ifdefHAL_MMC_MODULE_ENABLED#include"stm32l4xx_hal_mmc.h"#endif#ifdefHAL_NAND_MODULE_ENABLED#include"stm32l4xx_hal_nand.h"#endif#ifdefHAL_NOR_MODULE_ENABLED#include"stm32l4xx_hal_nor.h"#endif#ifdefHAL_OPAMP_MODULE_ENABLED#include"stm32l4xx_hal_opamp.h"#endif#ifdefHAL_OSPI_MODULE_ENABLED#include"stm32l4xx_hal_ospi.h"#endif#ifdefHAL_PCD_MODULE_ENABLED#include"stm32l4xx_hal_pcd.h"#endif#ifdefHAL_PKA_MODULE_ENABLED#include"stm32l4xx_hal_pka.h"#endif#ifdefHAL_PSSI_MODULE_ENABLED#include"stm32l4xx_hal_pssi.h"#endif#ifdefHAL_PWR_MODULE_ENABLED#include"stm32l4xx_hal_pwr.h"#endif#ifdefHAL_QSPI_MODULE_ENABLED#include"stm32l4xx_hal_qspi.h"#endif#ifdefHAL_RNG_MODULE_ENABLED#include"stm32l4xx_hal_rng.h"#endif#ifdefHAL_RTC_MODULE_ENABLED#include"stm32l4xx_hal_rtc.h"#endif#ifdefHAL_SAI_MODULE_ENABLED#include"stm32l4xx_hal_sai.h"#endif#ifdefHAL_SD_MODULE_ENABLED#include"stm32l4xx_hal_sd.h"#endif#ifdefHAL_SMARTCARD_MODULE_ENABLED#include"stm32l4xx_hal_smartcard.h"#endif#ifdefHAL_SMBUS_MODULE_ENABLED#include"stm32l4xx_hal_smbus.h"#endif#ifdefHAL_SPI_MODULE_ENABLED#include"stm32l4xx_hal_spi.h"#endif#ifdefHAL_SRAM_MODULE_ENABLED#include"stm32l4xx_hal_sram.h"#endif#ifdefHAL_SWPMI_MODULE_ENABLED#include"stm32l4xx_hal_swpmi.h"#endif#ifdefHAL_TIM_MODULE_ENABLED#include"stm32l4xx_hal_tim.h"#endif#ifdefHAL_TSC_MODULE_ENABLED#include"stm32l4xx_hal_tsc.h"#endif#ifdefHAL_UART_MODULE_ENABLED#include"stm32l4xx_hal_uart.h"#endif#ifdefHAL_USART_MODULE_ENABLED#include"stm32l4xx_hal_usart.h"#endif#ifdefHAL_WWDG_MODULE_ENABLED#include"stm32l4xx_hal_wwdg.h"#endif#ifdefUSE_FULL_ASSERT#defineassert_param(expr)((expr)?(void)0U:assert_failed((uint8_t*)__FILE__,__LINE__))voidassert_failed(uint8_t*file,uint32_tline);#else#defineassert_param(expr)((void)0U)#endif#ifdef__cplusplus}#endif#endif